{
  "<PAD>": 0,
  "<UNK>": 1,
  "ABRASIVE": 2,
  "ACCELERANT": 3,
  "ACCURACY": 4,
  "ACROBATICS": 5,
  "ADAPTIVE_STRIKE": 6,
  "ADRENALINE": 7,
  "AFTERIMAGE": 8,
  "AFTERLIFE": 9,
  "AGGRESSION": 10,
  "ALCHEMIZE": 11,
  "ALIGNMENT": 12,
  "ALL_FOR_ONE": 13,
  "ANGER": 14,
  "ANOINTED": 15,
  "ANTICIPATE": 16,
  "APOTHEOSIS": 17,
  "APPARITION": 18,
  "ARMAMENTS": 19,
  "ARSENAL": 20,
  "ASCENDERS_BANE": 21,
  "ASHEN_STRIKE": 22,
  "ASSASSINATE": 23,
  "ASTRAL_PULSE": 24,
  "AUTOMATION": 25,
  "BACKFLIP": 26,
  "BACKSTAB": 27,
  "BAD_LUCK": 28,
  "BALL_LIGHTNING": 29,
  "BANSHEES_CRY": 30,
  "BARRAGE": 31,
  "BARRICADE": 32,
  "BASH": 33,
  "BATTLE_TRANCE": 34,
  "BEACON_OF_HOPE": 35,
  "BEAM_CELL": 36,
  "BEAT_DOWN": 37,
  "BEAT_INTO_SHAPE": 38,
  "BECKON": 39,
  "BEGONE": 40,
  "BELIEVE_IN_YOU": 41,
  "BIASED_COGNITION": 42,
  "BIG_BANG": 43,
  "BLACK_HOLE": 44,
  "BLADE_DANCE": 45,
  "BLADE_OF_INK": 46,
  "BLIGHT_STRIKE": 47,
  "BLOODLETTING": 48,
  "BLOOD_WALL": 49,
  "BLUDGEON": 50,
  "BLUR": 51,
  "BODYGUARD": 52,
  "BODY_SLAM": 53,
  "BOLAS": 54,
  "BOMBARDMENT": 55,
  "BONE_SHARDS": 56,
  "BOOST_AWAY": 57,
  "BOOT_SEQUENCE": 58,
  "BORROWED_TIME": 59,
  "BOUNCING_FLASK": 60,
  "BRAND": 61,
  "BREAK": 62,
  "BREAKTHROUGH": 63,
  "BRIGHTEST_FLAME": 64,
  "BUBBLE_BUBBLE": 65,
  "BUFFER": 66,
  "BULK_UP": 67,
  "BULLET_TIME": 68,
  "BULLY": 69,
  "BULWARK": 70,
  "BUNDLE_OF_JOY": 71,
  "BURN": 72,
  "BURNING_PACT": 73,
  "BURST": 74,
  "BURY": 75,
  "BYRDONIS_EGG": 76,
  "BYRD_SWOOP": 77,
  "CALAMITY": 78,
  "CALCIFY": 79,
  "CALCULATED_GAMBLE": 80,
  "CALL_OF_THE_VOID": 81,
  "CALTROPS": 82,
  "CAPACITOR": 83,
  "CAPTURE_SPIRIT": 84,
  "CASCADE": 85,
  "CATASTROPHE": 86,
  "CELESTIAL_MIGHT": 87,
  "CHAOS": 88,
  "CHARGE": 89,
  "CHARGE_BATTERY": 90,
  "CHILD_OF_THE_STARS": 91,
  "CHILL": 92,
  "CINDER": 93,
  "CLASH": 94,
  "CLAW": 95,
  "CLEANSE": 96,
  "CLOAK_AND_DAGGER": 97,
  "CLOAK_OF_STARS": 98,
  "CLUMSY": 99,
  "COLD_SNAP": 100,
  "COLLISION_COURSE": 101,
  "COLOSSUS": 102,
  "COMET": 103,
  "COMPACT": 104,
  "COMPILE_DRIVER": 105,
  "CONFLAGRATION": 106,
  "CONQUEROR": 107,
  "CONSUMING_SHADOW": 108,
  "CONVERGENCE": 109,
  "COOLANT": 110,
  "COOLHEADED": 111,
  "COORDINATE": 112,
  "CORROSIVE_WAVE": 113,
  "CORRUPTION": 114,
  "COSMIC_INDIFFERENCE": 115,
  "COUNTDOWN": 116,
  "CRASH_LANDING": 117,
  "CREATIVE_AI": 118,
  "CRESCENT_SPEAR": 119,
  "CRIMSON_MANTLE": 120,
  "CRUELTY": 121,
  "CRUSH_UNDER": 122,
  "CURSE_OF_THE_BELL": 123,
  "DAGGER_SPRAY": 124,
  "DAGGER_THROW": 125,
  "DANSE_MACABRE": 126,
  "DARKNESS": 127,
  "DARK_EMBRACE": 128,
  "DARK_SHACKLES": 129,
  "DASH": 130,
  "DAZED": 131,
  "DEADLY_POISON": 132,
  "DEATHBRINGER": 133,
  "DEATHS_DOOR": 134,
  "DEATH_MARCH": 135,
  "DEBILITATE": 136,
  "DEBRIS": 137,
  "DEBT": 138,
  "DECAY": 139,
  "DECISIONS_DECISIONS": 140,
  "DEFEND_DEFECT": 141,
  "DEFEND_IRONCLAD": 142,
  "DEFEND_NECROBINDER": 143,
  "DEFEND_REGENT": 144,
  "DEFEND_SILENT": 145,
  "DEFILE": 146,
  "DEFLECT": 147,
  "DEFRAGMENT": 148,
  "DEFY": 149,
  "DELAY": 150,
  "DEMESNE": 151,
  "DEMONIC_SHIELD": 152,
  "DEMON_FORM": 153,
  "DEVASTATE": 154,
  "DEVOUR_LIFE": 155,
  "DIRGE": 156,
  "DISCOVERY": 157,
  "DISINTEGRATION": 158,
  "DISMANTLE": 159,
  "DISTRACTION": 160,
  "DODGE_AND_ROLL": 161,
  "DOMINATE": 162,
  "DOUBLE_ENERGY": 163,
  "DOUBT": 164,
  "DRAIN_POWER": 165,
  "DRAMATIC_ENTRANCE": 166,
  "DREDGE": 167,
  "DRUM_OF_BATTLE": 168,
  "DUALCAST": 169,
  "DUAL_WIELD": 170,
  "DYING_STAR": 171,
  "ECHOING_SLASH": 172,
  "ECHO_FORM": 173,
  "EIDOLON": 174,
  "END_OF_DAYS": 175,
  "ENERGY_SURGE": 176,
  "ENFEEBLING_TOUCH": 177,
  "ENLIGHTENMENT": 178,
  "ENTHRALLED": 179,
  "ENTRENCH": 180,
  "ENTROPY": 181,
  "ENVENOM": 182,
  "EQUILIBRIUM": 183,
  "ERADICATE": 184,
  "ESCAPE_PLAN": 185,
  "ETERNAL_ARMOR": 186,
  "EVIL_EYE": 187,
  "EXPECT_A_FIGHT": 188,
  "EXPERTISE": 189,
  "EXPOSE": 190,
  "EXTERMINATE": 191,
  "FALLING_STAR": 192,
  "FAN_OF_KNIVES": 193,
  "FASTEN": 194,
  "FEAR": 195,
  "FEED": 196,
  "FEEDING_FRENZY": 197,
  "FEEL_NO_PAIN": 198,
  "FERAL": 199,
  "FETCH": 200,
  "FIEND_FIRE": 201,
  "FIGHT_ME": 202,
  "FIGHT_THROUGH": 203,
  "FINESSE": 204,
  "FINISHER": 205,
  "FISTICUFFS": 206,
  "FLAK_CANNON": 207,
  "FLAME_BARRIER": 208,
  "FLANKING": 209,
  "FLASH_OF_STEEL": 210,
  "FLATTEN": 211,
  "FLECHETTES": 212,
  "FLICK_FLACK": 213,
  "FOCUSED_STRIKE": 214,
  "FOLLOW_THROUGH": 215,
  "FOLLY": 216,
  "FOOTWORK": 217,
  "FORBIDDEN_GRIMOIRE": 218,
  "FOREGONE_CONCLUSION": 219,
  "FORGOTTEN_RITUAL": 220,
  "FRANTIC_ESCAPE": 221,
  "FRIENDSHIP": 222,
  "FTL": 223,
  "FUEL": 224,
  "FURNACE": 225,
  "FUSION": 226,
  "GAMMA_BLAST": 227,
  "GANG_UP": 228,
  "GATHER_LIGHT": 229,
  "GENESIS": 230,
  "GENETIC_ALGORITHM": 231,
  "GIANT_ROCK": 232,
  "GLACIER": 233,
  "GLASSWORK": 234,
  "GLIMMER": 235,
  "GLIMPSE_BEYOND": 236,
  "GLITTERSTREAM": 237,
  "GLOW": 238,
  "GOLD_AXE": 239,
  "GO_FOR_THE_EYES": 240,
  "GRAND_FINALE": 241,
  "GRAPPLE": 242,
  "GRAVEBLAST": 243,
  "GRAVE_WARDEN": 244,
  "GREED": 245,
  "GUARDS": 246,
  "GUIDING_STAR": 247,
  "GUILTY": 248,
  "GUNK_UP": 249,
  "HAILSTORM": 250,
  "HAMMER_TIME": 251,
  "HAND_OF_GREED": 252,
  "HAND_TRICK": 253,
  "HANG": 254,
  "HAUNT": 255,
  "HAVOC": 256,
  "HAZE": 257,
  "HEADBUTT": 258,
  "HEAVENLY_DRILL": 259,
  "HEGEMONY": 260,
  "HEIRLOOM_HAMMER": 261,
  "HELIX_DRILL": 262,
  "HELLO_WORLD": 263,
  "HELLRAISER": 264,
  "HEMOKINESIS": 265,
  "HIDDEN_CACHE": 266,
  "HIDDEN_DAGGERS": 267,
  "HIDDEN_GEM": 268,
  "HIGH_FIVE": 269,
  "HOLOGRAM": 270,
  "HOTFIX": 271,
  "HOWL_FROM_BEYOND": 272,
  "HUDDLE_UP": 273,
  "HYPERBEAM": 274,
  "ICE_LANCE": 275,
  "IGNITION": 276,
  "IMPATIENCE": 277,
  "IMPERVIOUS": 278,
  "INFECTION": 279,
  "INFERNAL_BLADE": 280,
  "INFERNO": 281,
  "INFINITE_BLADES": 282,
  "INFLAME": 283,
  "INJURY": 284,
  "INTERCEPT": 285,
  "INVOKE": 286,
  "IRON_WAVE": 287,
  "ITERATION": 288,
  "I_AM_INVINCIBLE": 289,
  "JACKPOT": 290,
  "JACK_OF_ALL_TRADES": 291,
  "JUGGERNAUT": 292,
  "JUGGLING": 293,
  "KINGLY_KICK": 294,
  "KINGLY_PUNCH": 295,
  "KNIFE_TRAP": 296,
  "KNOCKDOWN": 297,
  "KNOCKOUT_BLOW": 298,
  "KNOW_THY_PLACE": 299,
  "LANTERN_KEY": 300,
  "LARGESSE": 301,
  "LEADING_STRIKE": 302,
  "LEAP": 303,
  "LEGION_OF_BONE": 304,
  "LEG_SWEEP": 305,
  "LETHALITY": 306,
  "LIFT": 307,
  "LIGHTNING_ROD": 308,
  "LOOP": 309,
  "LUMINESCE": 310,
  "LUNAR_BLAST": 311,
  "MACHINE_LEARNING": 312,
  "MAD_SCIENCE": 313,
  "MAKE_IT_SO": 314,
  "MALAISE": 315,
  "MANGLE": 316,
  "MANIFEST_AUTHORITY": 317,
  "MASTER_OF_STRATEGY": 318,
  "MASTER_PLANNER": 319,
  "MAUL": 320,
  "MAYHEM": 321,
  "MELANCHOLY": 322,
  "MEMENTO_MORI": 323,
  "METAMORPHOSIS": 324,
  "METEOR_SHOWER": 325,
  "METEOR_STRIKE": 326,
  "MIMIC": 327,
  "MIND_BLAST": 328,
  "MIND_ROT": 329,
  "MINION_DIVE_BOMB": 330,
  "MINION_SACRIFICE": 331,
  "MINION_STRIKE": 332,
  "MIRAGE": 333,
  "MISERY": 334,
  "MODDED": 335,
  "MOLTEN_FIST": 336,
  "MOMENTUM_STRIKE": 337,
  "MONARCHS_GAZE": 338,
  "MONOLOGUE": 339,
  "MULTI_CAST": 340,
  "MURDER": 341,
  "NECRO_MASTERY": 342,
  "NEGATIVE_PULSE": 343,
  "NEOWS_FURY": 344,
  "NEUROSURGE": 345,
  "NEUTRALIZE": 346,
  "NEUTRON_AEGIS": 347,
  "NIGHTMARE": 348,
  "NORMALITY": 349,
  "NOSTALGIA": 350,
  "NOXIOUS_FUMES": 351,
  "NO_ESCAPE": 352,
  "NULL": 353,
  "OBLIVION": 354,
  "OFFERING": 355,
  "OMNISLICE": 356,
  "ONE_TWO_PUNCH": 357,
  "ORBIT": 358,
  "OUTBREAK": 359,
  "OUTMANEUVER": 360,
  "OVERCLOCK": 361,
  "PACTS_END": 362,
  "PAGESTORM": 363,
  "PALE_BLUE_DOT": 364,
  "PANACHE": 365,
  "PANIC_BUTTON": 366,
  "PARRY": 367,
  "PARSE": 368,
  "PARTICLE_WALL": 369,
  "PATTER": 370,
  "PECK": 371,
  "PERFECTED_STRIKE": 372,
  "PHANTOM_BLADES": 373,
  "PHOTON_CUT": 374,
  "PIERCING_WAIL": 375,
  "PILLAGE": 376,
  "PILLAR_OF_CREATION": 377,
  "PINPOINT": 378,
  "POISONED_STAB": 379,
  "POKE": 380,
  "POMMEL_STRIKE": 381,
  "POOR_SLEEP": 382,
  "POUNCE": 383,
  "PRECISE_CUT": 384,
  "PREDATOR": 385,
  "PREPARED": 386,
  "PREP_TIME": 387,
  "PRIMAL_FORCE": 388,
  "PRODUCTION": 389,
  "PROLONG": 390,
  "PROPHESIZE": 391,
  "PROTECTOR": 392,
  "PROWESS": 393,
  "PULL_AGGRO": 394,
  "PULL_FROM_BELOW": 395,
  "PURITY": 396,
  "PUTREFY": 397,
  "PYRE": 398,
  "QUADCAST": 399,
  "QUASAR": 400,
  "RADIATE": 401,
  "RAGE": 402,
  "RAINBOW": 403,
  "RALLY": 404,
  "RAMPAGE": 405,
  "RATTLE": 406,
  "REANIMATE": 407,
  "REAP": 408,
  "REAPER_FORM": 409,
  "REAVE": 410,
  "REBOOT": 411,
  "REBOUND": 412,
  "REFINE_BLADE": 413,
  "REFLECT": 414,
  "REFLEX": 415,
  "REFRACT": 416,
  "REGRET": 417,
  "RELAX": 418,
  "REND": 419,
  "RESONANCE": 420,
  "RESTLESSNESS": 421,
  "RICOCHET": 422,
  "RIGHT_HAND_HAND": 423,
  "RIP_AND_TEAR": 424,
  "ROCKET_PUNCH": 425,
  "ROLLING_BOULDER": 426,
  "ROYALTIES": 427,
  "ROYAL_GAMBLE": 428,
  "RUPTURE": 429,
  "SACRIFICE": 430,
  "SALVO": 431,
  "SCAVENGE": 432,
  "SCOURGE": 433,
  "SCRAPE": 434,
  "SCRAWL": 435,
  "SCULPTING_STRIKE": 436,
  "SEANCE": 437,
  "SECOND_WIND": 438,
  "SECRET_TECHNIQUE": 439,
  "SECRET_WEAPON": 440,
  "SEEKER_STRIKE": 441,
  "SEEKING_EDGE": 442,
  "SENTRY_MODE": 443,
  "SERPENT_FORM": 444,
  "SETUP_STRIKE": 445,
  "SEVEN_STARS": 446,
  "SEVERANCE": 447,
  "SHADOWMELD": 448,
  "SHADOW_SHIELD": 449,
  "SHADOW_STEP": 450,
  "SHAME": 451,
  "SHARED_FATE": 452,
  "SHATTER": 453,
  "SHINING_STRIKE": 454,
  "SHIV": 455,
  "SHOCKWAVE": 456,
  "SHROUD": 457,
  "SHRUG_IT_OFF": 458,
  "SIC_EM": 459,
  "SIGNAL_BOOST": 460,
  "SKEWER": 461,
  "SKIM": 462,
  "SLEIGHT_OF_FLESH": 463,
  "SLICE": 464,
  "SLIMED": 465,
  "SLOTH": 466,
  "SMOKESTACK": 467,
  "SNAKEBITE": 468,
  "SNAP": 469,
  "SNEAKY": 470,
  "SOLAR_STRIKE": 471,
  "SOOT": 472,
  "SOUL": 473,
  "SOUL_STORM": 474,
  "SOVEREIGN_BLADE": 475,
  "SOW": 476,
  "SPECTRUM_SHIFT": 477,
  "SPEEDSTER": 478,
  "SPINNER": 479,
  "SPIRIT_OF_ASH": 480,
  "SPITE": 481,
  "SPLASH": 482,
  "SPOILS_MAP": 483,
  "SPOILS_OF_BATTLE": 484,
  "SPORE_MIND": 485,
  "SPUR": 486,
  "SQUASH": 487,
  "SQUEEZE": 488,
  "STACK": 489,
  "STAMPEDE": 490,
  "STARDUST": 491,
  "STOKE": 492,
  "STOMP": 493,
  "STONE_ARMOR": 494,
  "STORM": 495,
  "STORM_OF_STEEL": 496,
  "STRANGLE": 497,
  "STRATAGEM": 498,
  "STRIKE_DEFECT": 499,
  "STRIKE_IRONCLAD": 500,
  "STRIKE_NECROBINDER": 501,
  "STRIKE_REGENT": 502,
  "STRIKE_SILENT": 503,
  "SUBROUTINE": 504,
  "SUCKER_PUNCH": 505,
  "SUMMON_FORTH": 506,
  "SUNDER": 507,
  "SUPERCRITICAL": 508,
  "SUPERMASSIVE": 509,
  "SUPPRESS": 510,
  "SURVIVOR": 511,
  "SWEEPING_BEAM": 512,
  "SWEEPING_GAZE": 513,
  "SWORD_BOOMERANG": 514,
  "SWORD_SAGE": 515,
  "SYNCHRONIZE": 516,
  "SYNTHESIS": 517,
  "TACTICIAN": 518,
  "TAG_TEAM": 519,
  "TANK": 520,
  "TAUNT": 521,
  "TEAR_ASUNDER": 522,
  "TEMPEST": 523,
  "TERRAFORMING": 524,
  "TESLA_COIL": 525,
  "THE_BOMB": 526,
  "THE_GAMBIT": 527,
  "THE_HUNT": 528,
  "THE_SCYTHE": 529,
  "THE_SEALED_THRONE": 530,
  "THE_SMITH": 531,
  "THINKING_AHEAD": 532,
  "THRASH": 533,
  "THRUMMING_HATCHET": 534,
  "THUNDER": 535,
  "THUNDERCLAP": 536,
  "TIMES_UP": 537,
  "TOOLS_OF_THE_TRADE": 538,
  "TORIC_TOUGHNESS": 539,
  "TOXIC": 540,
  "TRACKING": 541,
  "TRANSFIGURE": 542,
  "TRASH_TO_TREASURE": 543,
  "TREMBLE": 544,
  "TRUE_GRIT": 545,
  "TURBO": 546,
  "TWIN_STRIKE": 547,
  "TYRANNY": 548,
  "ULTIMATE_DEFEND": 549,
  "ULTIMATE_STRIKE": 550,
  "UNDEATH": 551,
  "UNLEASH": 552,
  "UNMOVABLE": 553,
  "UNRELENTING": 554,
  "UNTOUCHABLE": 555,
  "UPPERCUT": 556,
  "UPROAR": 557,
  "UP_MY_SLEEVE": 558,
  "VEILPIERCER": 559,
  "VENERATE": 560,
  "VICIOUS": 561,
  "VOID": 562,
  "VOID_FORM": 563,
  "VOLLEY": 564,
  "VOLTAIC": 565,
  "WASTE_AWAY": 566,
  "WELL_LAID_PLANS": 567,
  "WHIRLWIND": 568,
  "WHISTLE": 569,
  "WHITE_NOISE": 570,
  "WISH": 571,
  "WISP": 572,
  "WOUND": 573,
  "WRAITH_FORM": 574,
  "WRITHE": 575,
  "WROUGHT_IN_WAR": 576,
  "ZAP": 577
}